StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/core/rtw_wnm.c
	ptr = pdata;
	pend = ptr + data_len;
	elem_len = data_len;
	subelem_len = (u32) * (pdata + 1);

	for (i = 0; i < RTW_MAX_NB_RPT_NUM; i++) {
		if (((ptr + 7) > pend) || (elem_len < subelem_len)) {
			break;
		}

		if (*ptr != RTW_WLAN_ACTION_WNM_NB_RPT_ELEM) {
			RTW_WNM_INFO("WNM: end of data(0x%2x)!\n", *ptr);
			break;
		}

		pie = (struct nb_rpt_hdr *)ptr;
		if (from_btm) {
			op = rtw_get_ie((u8 *)(ptr + 15),
					WNM_BTM_CAND_PREF_SUBEID,
					&op_len, (subelem_len - 15));
		}

		ptr = (u8 *)(ptr + subelem_len + 2);
		elem_len -= (subelem_len + 2);
		subelem_len = *(ptr + 1);
		if (from_btm) {
			pcandidate = (pcandidates + i);
			_rtw_memcpy(&pcandidate->nb_rpt, pie, sizeof(struct nb_rpt_hdr));
			if (op && (op_len != 0)) {
				pcandidate->preference = *(op + 2);
				bfound = _TRUE;
			} else {
				pcandidate->preference = 0;
			}

			RTW_WNM_INFO("WNM: preference check bssid("MAC_FMT
				     ") ,bss_info(0x%04X), reg_class(0x%02X), ch(%d),"
				     " phy_type(0x%02X), preference(0x%02X)\n",
				     MAC_ARG(pcandidate->nb_rpt.bssid), pcandidate->nb_rpt.bss_info,
				     pcandidate->nb_rpt.reg_class, pcandidate->nb_rpt.ch_num,
				     pcandidate->nb_rpt.phy_type, pcandidate->preference);
		} else {
			if (_rtw_memcmp(&pnb->nb_rpt[i], pie, sizeof(struct nb_rpt_hdr)) == _FALSE) {
				*nb_rpt_is_same = _FALSE;
			}
			_rtw_memcpy(&pnb->nb_rpt[i], pie, sizeof(struct nb_rpt_hdr));
		}
		nb_rpt_entries++;
	}

	if (from_btm) {
		pnb->preference_en = (bfound) ? _TRUE : _FALSE;
	}

	*nb_rpt_num = nb_rpt_entries;
	return ret;
}

/* selection sorting based on preference value
 * IN : 		nb_rpt_entries - candidate num
 * IN/OUT :	pcandidates	- candidate list
 * return : TRUE - means pcandidates is updated.
 */
static u8 rtw_wnm_candidates_sorting(
	u32 nb_rpt_entries, struct wnm_btm_cant *pcandidates)
{
	u8 updated = _FALSE;
	u32 i, j, pos;
	struct wnm_btm_cant swap;
	struct wnm_btm_cant *pcant_1, *pcant_2;

	if ((!nb_rpt_entries) || (!pcandidates)) {
		return updated;
	}

	for (i = 0; i < (nb_rpt_entries - 1); i++) {
		pos = i;
		for (j = (i + 1); j < nb_rpt_entries; j++) {
			pcant_1 = pcandidates + pos;
			pcant_2 = pcandidates + j;
			if ((pcant_1->preference) < (pcant_2->preference)) {
				pos = j;
			}
		}

		if (pos != i) {
			updated = _TRUE;
			_rtw_memcpy(&swap, (pcandidates + i), sizeof(struct wnm_btm_cant));
			_rtw_memcpy((pcandidates + i), (pcandidates + pos), sizeof(struct wnm_btm_cant));
			_rtw_memcpy((pcandidates + pos), &swap, sizeof(struct wnm_btm_cant));
		}
	}
	return updated;
}

static void rtw_wnm_nb_info_update(
	u32 nb_rpt_entries, u8 from_btm,
	struct roam_nb_info *pnb, struct wnm_btm_cant *pcandidates,
	u8 *nb_rpt_is_same)
{
	u8 is_found;
	u32 i, j;
	struct wnm_btm_cant *pcand;

	if (!pnb) {
		return;
	}

	pnb->nb_rpt_ch_list_num = 0;
	for (i = 0; i < nb_rpt_entries; i++) {
		is_found = _FALSE;
		if (from_btm) {
			pcand = (pcandidates + i);
			if (_rtw_memcmp(&pnb->nb_rpt[i], &pcand->nb_rpt,
					sizeof(struct nb_rpt_hdr)) == _FALSE) {
				*nb_rpt_is_same = _FALSE;
			}
			_rtw_memcpy(&pnb->nb_rpt[i], &pcand->nb_rpt, sizeof(struct nb_rpt_hdr));
		}

		RTW_WNM_INFO("WNM: bssid(" MAC_FMT
			     ") , bss_info(0x%04X), reg_class(0x%02X), ch_num(%d), phy_type(0x%02X)\n",
			     MAC_ARG(pnb->nb_rpt[i].bssid), pnb->nb_rpt[i].bss_info,
			     pnb->nb_rpt[i].reg_class, pnb->nb_rpt[i].ch_num,
			     pnb->nb_rpt[i].phy_type);

		if (pnb->nb_rpt[i].ch_num == 0) {
			continue;
		}

		for (j = 0; j < nb_rpt_entries; j++) {
			if (pnb->nb_rpt[i].ch_num == pnb->nb_rpt_ch_list[j].hw_value) {
				is_found = _TRUE;
				break;
			}
		}

		if (!is_found) {
			pnb->nb_rpt_ch_list[pnb->nb_rpt_ch_list_num].hw_value = pnb->nb_rpt[i].ch_num;
			pnb->nb_rpt_ch_list_num++;
		}
	}
}

static void rtw_wnm_btm_candidate_select(_adapter *padapter)
{
	struct mlme_priv *pmlmepriv = &(padapter->mlmepriv);
	struct roam_nb_info *pnb = &(padapter->mlmepriv.nb_info);
	struct wlan_network *pnetwork;
	u8 bfound = _FALSE;
	u8 ignore_currrent = _FALSE;
	u32 i;

#ifdef CONFIG_RTW_80211R
	if (rtw_ft_chk_flags(padapter, RTW_FT_BTM_ROAM)) {
		ignore_currrent = _TRUE;
	}
#endif

	for (i = 0; i < pnb->last_nb_rpt_entries; i++) {
		if (ignore_currrent &&
		    (_rtw_memcmp(pnb->nb_rpt[i].bssid, \
				 padapter->mlmepriv.cur_network.network.MacAddress, ETH_ALEN))) {
			RTW_WNM_INFO("WNM : ignore candidate "MAC_FMT" for it's connected(%u)!\n",
				     MAC_ARG(pnb->nb_rpt[i].bssid), i);
			continue;
		}

		pnetwork = rtw_find_network(
				   &(pmlmepriv->scanned_queue),
				   pnb->nb_rpt[i].bssid);

		if (pnetwork) {
			bfound = _TRUE;
			break;
		}
	}

	if (bfound) {
		_rtw_memcpy(pnb->roam_target_addr, pnb->nb_rpt[i].bssid, ETH_ALEN);
		RTW_INFO("WNM : select btm entry(%d) - %s("MAC_FMT", ch:%u) rssi:%d\n"
			 , i
			 , pnetwork->network.Ssid.Ssid
			 , MAC_ARG(pnetwork->network.MacAddress)
			 , pnetwork->network.Configuration.DSConfig
			 , (int)pnetwork->network.Rssi);
	} else {
		_rtw_memset(pnb->roam_target_addr, 0, ETH_ALEN);
	}
}

u32 rtw_wnm_btm_candidates_survey(
	_adapter *padapter, u8 *pframe, u32 elem_len, u8 from_btm)
{
	struct roam_nb_info *pnb = &(padapter->mlmepriv.nb_info);
	struct wnm_btm_cant *pcandidate_list = NULL;
	u8 nb_rpt_is_same = _TRUE;
	u32	ret = _FAIL;
	u32 nb_rpt_entries = 0;

	if (from_btm) {
		u32 mlen = sizeof(struct wnm_btm_cant) * RTW_MAX_NB_RPT_NUM;
		pcandidate_list = (struct wnm_btm_cant *)rtw_malloc(mlen);
		if (pcandidate_list == NULL) {
			goto exit;
		}
	}

	/*clean the status set last time*/
	_rtw_memset(&pnb->nb_rpt_ch_list, 0, sizeof(pnb->nb_rpt_ch_list));
	pnb->nb_rpt_valid = _FALSE;
	if (!rtw_wnm_nb_elem_parsing(
		    pframe, elem_len, from_btm,
		    &nb_rpt_entries, &nb_rpt_is_same,
		    pnb, pcandidate_list)) {
		goto exit;
	}

	if (nb_rpt_entries != 0) {
		if ((from_btm) && (rtw_wnm_btm_preference_cap(padapter))) {
			rtw_wnm_candidates_sorting(nb_rpt_entries, pcandidate_list);
		}

		rtw_wnm_nb_info_update(
			nb_rpt_entries, from_btm,
			pnb, pcandidate_list, &nb_rpt_is_same);
	}

	RTW_WNM_INFO("nb_rpt_is_same = %d, nb_rpt_entries = %d, last_nb_rpt_entries = %d\n",
		     nb_rpt_is_same, nb_rpt_entries, pnb->last_nb_rpt_entries);
	if ((nb_rpt_is_same == _TRUE) && (nb_rpt_entries == pnb->last_nb_rpt_entries)) {
		pnb->nb_rpt_is_same = _TRUE;
	} else {
		pnb->nb_rpt_is_same = _FALSE;
		pnb->last_nb_rpt_entries = nb_rpt_entries;
	}

	if ((from_btm) && (nb_rpt_entries != 0)) {
		rtw_wnm_btm_candidate_select(padapter);
	}

	pnb->nb_rpt_valid = _TRUE;
	ret = _SUCCESS;

exit:
	if (from_btm && pcandidate_list) {
		rtw_mfree((u8 *)pcandidate_list, sizeof(struct wnm_btm_cant) * RTW_MAX_NB_RPT_NUM);
	}

	return ret;
}

#endif /*defined(CONFIG_RTW_WNM) || defined(CONFIG_RTW_80211K) */

